# Split Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Toposolid..::..Split Method
Toposolid Class See Also
---
Split the toposolid by the given curve loops.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public IList<ElementId> Split(
	IList<CurveLoop> splitCurveLoops
)
```

Visual Basic
---
```text
Public Function Split ( _
	splitCurveLoops As IList(Of CurveLoop) _
) As IList(Of ElementId)
```

Visual C++
---
```text
public:
IList<ElementId^>^ Split(
	IList<CurveLoop^>^ splitCurveLoops
)
```

# ### Parameters
splitCurveLoops
    Type: System.Collections.Generic..::..IList<(Of <(<'CurveLoop>)>)> An array of planar curve loops that are used to split the toposolid. All of the curve loops should lie on the sketch plane of the toposolid.
# ### Return Value
An array of newly created toposolid ids after split.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The split curve loops should all lie on the sketch plane of the toposolid. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Toposolid Class
Autodesk.Revit.DB Namespace